In [10]:
from sqlalchemy import create_engine, inspect, func
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
import pandas as pd
import matplotlib
import matplotlib.pyplot as plt
from matplotlib import style
import psycopg2
from pw import password

In [20]:
#create an engine for the employees_db database
engine = create_engine(f'postgresql+psycopg2://postgres:{password}@localhost:5432/employee_db')

In [22]:
#show all the table inside the employee dababase
inspector = inspect(engine)
inspector.get_table_names()

['salaries',
 'dept_emp',
 'departments',
 'dept_manager',
 'employees',
 'titles',
 'descending_frequency_table',
 'development_sales_table',
 'employee_department_table',
 'employees_salary_table',
 'hercules_out_table',
 'hire_1986_table',
 'manager_department_table',
 'sales_department_table']

In [32]:
#use 'engine.execute' to select and display the first 10 rows fromt he emoji table
engine.execute('SELECT * FROM employees LIMIT 10').fetchall()

[(473302, 's0001', datetime.date(1953, 7, 25), 'Hideyuki', 'Zallocco', 'M', datetime.date(1990, 4, 28)),
 (475053, 'e0002', datetime.date(1954, 11, 18), 'Byong', 'Delgrande', 'F', datetime.date(1991, 9, 7)),
 (57444, 'e0002', datetime.date(1958, 1, 30), 'Berry', 'Babb', 'F', datetime.date(1992, 3, 21)),
 (421786, 's0001', datetime.date(1957, 9, 28), 'Xiong', 'Verhoeff', 'M', datetime.date(1987, 11, 26)),
 (282238, 'e0003', datetime.date(1952, 10, 28), 'Abdelkader', 'Baumann', 'F', datetime.date(1991, 1, 18)),
 (263976, 'e0003', datetime.date(1959, 10, 30), 'Eran', 'Cusworth', 'M', datetime.date(1986, 11, 14)),
 (273487, 's0001', datetime.date(1957, 4, 14), 'Christoph', 'Parfitt', 'M', datetime.date(1991, 6, 28)),
 (461591, 's0002', datetime.date(1964, 11, 17), 'Xudong', 'Samarati', 'M', datetime.date(1985, 11, 13)),
 (477657, 'e0002', datetime.date(1962, 12, 18), 'Lihong', 'Magliocco', 'M', datetime.date(1993, 10, 23)),
 (219881, 's0002', datetime.date(1956, 4, 24), 'Kwangyoen', 'Speek', 'F', datetime.date(1993, 2, 14))]

In [44]:
e = engine.execute('SELECT * FROM employees').fetchall()
#columns = ['emp_no', 'emp_title_id','birth_date','first_name','last_name','sex','hire_date']
employees_pd = pd.DataFrame(e,columns = ['emp_no', 'emp_title_id','birth_date','first_name','last_name','sex','hire_date'])

employees_pd.head()

   emp_no emp_title_id  birth_date  first_name  last_name sex   hire_date
0  473302        s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28
1  475053        e0002  1954-11-18       Byong  Delgrande   F  1991-09-07
2   57444        e0002  1958-01-30       Berry       Babb   F  1992-03-21
3  421786        s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26
4  282238        e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18

In [31]:
#Reflect database into class
Base = automap_base()
Base.prepare(engine, reflect = True)
print(Base.classes.keys())

['salaries', 'departments', 'titles']

In [49]:
columns = inspector.get_columns('salaries')
for c in columns:
    print(c['name'], c["type"])

emp_no INTEGER
salary INTEGER

In [50]:
columns = inspector.get_columns('titles')
for c in columns:
    print(c['name'], c["type"])

title_id VARCHAR
title VARCHAR

In [45]:
Titles = Base.classes.titles
Salaries = Base.classes.salaries

In [52]:
#Create a session
session = Session(engine)

In [56]:
#put salary results into pd
results_salary = (session.query(Salaries.emp_no, Salaries.salary).all())

In [57]:
salaries = pd.DataFrame(results_salary)
salaries.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [58]:
#put title results into pd
results_title = (session.query(Titles.title_id, Titles.title).all())

In [60]:
titles = pd.DataFrame(results_title)
titles.head()

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer

In [61]:
#merge employees, titles and salaries table together
employees_salary = employees_pd.merge(salaries, on = 'emp_no', how = 'outer')
employees_salary_title = employees_salary.merge(titles, left_on = 'emp_title_id', right_on='title_id',how = 'outer')
employees_salary_title.head()

,emp_no,emp_title_id,birth_date,first_name,last_name,sex,hire_date,salary,title_id,title
0,473302,s0001,1953-07-25,Hideyuki,Zallocco,M,1990-04-28,40000,s0001,Staff
1,421786,s0001,1957-09-28,Xiong,Verhoeff,M,1987-11-26,40000,s0001,Staff
2,273487,s0001,1957-04-14,Christoph,Parfitt,M,1991-06-28,56087,s0001,Staff
3,246449,s0001,1958-03-23,Subbu,Bultermann,F,1988-03-25,87084,s0001,Staff
4,48085,s0001,1964-01-19,Venkatesan,Gilg,M,1993-06-28,63016,s0001,Staff